Documents/ИнформацияОСтудентах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИнформацияОСтудентах</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнформацияОРодителях</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИОСтудента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГдеИКемРаботаютРодители</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРодителей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПроживанияСтудента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИнформацияОСтудентах/Ext/ManagerModule.bsl
Процедура ПечатьИнформацииДляЖурнала(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьИнформацииДляЖурнала)
	Макет = Документы.ИнформацияОСтудентах.ПолучитьМакет("ПечатьИнформацииДляЖурнала");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнформацияОСтудентах.Дата,
	|	ИнформацияОСтудентах.Комментарий,
	|	ИнформацияОСтудентах.Номер,
	|	ИнформацияОСтудентах.ИнформацияОРодителях.(
	|		НомерСтроки,
	|		ФИОСтудента,
	|		ГдеИКемРаботаютРодители,
	|		АдресРодителей,
	|		АдресПроживанияСтудента
	|	)
	|ИЗ
	|	Документ.ИнформацияОСтудентах КАК ИнформацияОСтудентах
	|ГДЕ
	|	ИнформацияОСтудентах.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИнформацияОРодителяхШапка = Макет.ПолучитьОбласть("ИнформацияОРодителяхШапка");
	ОбластьИнформацияОРодителях = Макет.ПолучитьОбласть("ИнформацияОРодителях");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьИнформацияОРодителяхШапка);
		ВыборкаИнформацияОРодителях = Выборка.ИнформацияОРодителях.Выбрать();
		Пока ВыборкаИнформацияОРодителях.Следующий() Цикл
			ОбластьИнформацияОРодителях.Параметры.Заполнить(ВыборкаИнформацияОРодителях);
			ТабДок.Вывести(ОбластьИнформацияОРодителях, ВыборкаИнформацияОРодителях.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
